html/meeting-notes/2012-11-13.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Meeting Notes 2012-11-13</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-14 17:49:52 EST"/>
<meta name="author" content="Rafe Kettler"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<h1 class="title">Meeting Notes 2012-11-13</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">The Emacs Club C tutorial </a></li>
<li><a href="#sec-2">GDB, Mountain Lion, and Emacs: The Final Countdown </a></li>
<li><a href="#sec-3">Using emacsclient as a collaborative editing tool </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">The Emacs Club C tutorial </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>
Tomorrow
</li>
<li>
Mish needs a partner to teach &ndash; Andrew volunteers
</li>
<li>
We'll package a starter .emacs that will do some basic C configuration
</li>
<li>
Time budget is an issue &ndash; we want to introduce people to Emacs, but too much introductory material might prevent us from talking about specific things about C development in Emacs
<ul>
<li>
Benjamin's plan: spend 15 minutes demonstrating Emacs basics through C development and then dive into more advanced features
</li>
</ul>
</li>
<li>
Do we do it on Eniac:
<ul>
<li>
Pros: this is what many 240 students (Windows users) have to use; it will force learning
</li>
<li>
Cons: we don't know what people come in knowing
</li>
</ul>
</li>
<li>
Should we show them multiple windows? Yes, but in a simplified form
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">GDB, Mountain Lion, and Emacs: The Final Countdown </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>
Mountain Lion apparently breaks GDB in Emacs 24.
</li>
<li>
See <a href="http://stackoverflow.com/questions/8336433/gdb-on-macosx-lion">http://stackoverflow.com/questions/8336433/gdb-on-macosx-lion</a> and <a href="http://stackoverflow.com/questions/10221448/emacs-24-and-gdb-6-3-on-mac-os-lion">http://stackoverflow.com/questions/10221448/emacs-24-and-gdb-6-3-on-mac-os-lion</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Using emacsclient as a collaborative editing tool </h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>
Building the .emacs for the C tutorial
</li>
<li>
Surprisingly, it doesn't work very well
</li>
</ul>

</div>
</div>
<div id="postamble">
<p class="author"> Author: Rafe Kettler
</p>
<p class="date"> Date: 2012-11-14 17:49:52 EST</p>
<p class="creator">HTML generated by org-mode 7.3 in emacs 24</p>
</div>
</div>
</body>
</html>
